package day06.ex01;

public class student {
    public static void main(String[] args) {

//클래스 원형 , 설계도, 틀

            //1. 필드, 멤버변수, 인스턴스변수
            //2. 생성자
            //3. 메서드
        }

/*
    객체 :
    각종 사물 ( 보고, 만질수 있고 .. 모든 대상 )
    사람,  강아지, 컴퓨터, 마우스..

    속성: 고유값
    메서드 : 행동

    객체 : 강아지
    객체.속성(특성) : 털색, 종, 나이..
    객체.메서드() : 뛰기, 걷기, 구르기..

    객체(인스턴스)
    속성 : 필드, 인스턴스변수, 멤버변수
    메서드() : 함수()

    클래스 : 설계도
             원형
             붕어빵의 틀
             자동차의 설계도면

   인스턴스(객체) : 메모리 차지 ( 참조형 )
   틀에서 찍어서 나온 결과
   붕어빵틀에서 나온오 팥붕어빵

   인스턴스  => 변수(필드), 생성자, 메서드 : 클래스틀에서 제공
      //실행
  //클래스타입  변수(인스턴스명)  = 클래스선언:메모리생성(힙메모리)
    // 객체 - 참조형 ( 메모리주소 :x1000 )
    Student s1 = new Student();
//    Student s1 = x1000
    System.out.println("s1 인스턴스변수가 Student객체를 참조");

    Student s2 = new Student();
    //Student s2 = y1000
    System.out.println("s2 인스턴스변수가 Student객체를 참조");

 */
    }

